In [4]:
import pandas as pd

In [5]:
import numpy as np

# Series data structure in pandas

In [6]:
list1=[10,20,30,40,50,60]
list1

[10, 20, 30, 40, 50, 60]

In [10]:
s1=pd.Series(list1,index=["A","B","C","D","E","F"])
s1

A    10
B    20
C    30
D    40
E    50
F    60
dtype: int64

In [13]:
array1=np.random.randint(1,50,size=5)
array1

array([34, 36, 34, 22, 15], dtype=int32)

In [14]:
array2=np.random.randint(1,50,size=5)
array2

array([19, 46, 14, 15, 32], dtype=int32)

In [15]:
srr11=pd.Series(array1)
srr22=pd.Series(array2)

In [17]:
srr11

0    34
1    36
2    34
3    22
4    15
dtype: int32

In [18]:
srr22

0    19
1    46
2    14
3    15
4    32
dtype: int32

In [19]:
srr11+srr22

0    53
1    82
2    48
3    37
4    47
dtype: int32

# Dataframe for 2D dataset

In [20]:
student_name=["Ram","Shyam","Hari","Krishna","Shiva"]
student_roll=["101","102","105","104","109"]
student_mark=[98.5,45.75,33.33,64.56,99.00]

In [25]:
student_dict={
    "Student Name":student_name,
    "Roll No.":student_roll,
    "Marks Obtained":student_mark
}

In [26]:
student_dict

{'Student Name': ['Ram', 'Shyam', 'Hari', 'Krishna', 'Shiva'],
 'Roll No.': ['101', '102', '105', '104', '109'],
 'Marks Obtained': [98.5, 45.75, 33.33, 64.56, 99.0]}

In [28]:
student_df=pd.DataFrame(student_dict)

In [29]:
student_df

  Student Name Roll No.  Marks Obtained
0          Ram      101           98.50
1        Shyam      102           45.75
2         Hari      105           33.33
3      Krishna      104           64.56
4        Shiva      109           99.00

In [31]:
student_df.set_index("Roll No.")

         Student Name  Marks Obtained
Roll No.
101               Ram           98.50
102             Shyam           45.75
105              Hari           33.33
104           Krishna           64.56
109             Shiva           99.00

In [32]:
student_df["Student Name"]

0        Ram
1      Shyam
2       Hari
3    Krishna
4      Shiva
Name: Student Name, dtype: object

In [33]:
student_df["Roll No."]

0    101
1    102
2    105
3    104
4    109
Name: Roll No., dtype: object

In [34]:
student_df["Marks Obtained"]

0    98.50
1    45.75
2    33.33
3    64.56
4    99.00
Name: Marks Obtained, dtype: float64

In [36]:
student_df[["Student Name","Marks Obtained"]]

  Student Name  Marks Obtained
0          Ram           98.50
1        Shyam           45.75
2         Hari           33.33
3      Krishna           64.56
4        Shiva           99.00

# Adding new column in the existing dataframe

In [39]:
student_df

  Student Name Roll No.  Marks Obtained
0          Ram      101           98.50
1        Shyam      102           45.75
2         Hari      105           33.33
3      Krishna      104           64.56
4        Shiva      109           99.00

In [40]:
student_df["Address"]=["Biratnagar","Ithari","Inaruwa","Dharan","Duhabi"]

In [41]:
student_df

  Student Name Roll No.  Marks Obtained     Address
0          Ram      101           98.50  Biratnagar
1        Shyam      102           45.75      Ithari
2         Hari      105           33.33     Inaruwa
3      Krishna      104           64.56      Dharan
4        Shiva      109           99.00      Duhabi

In [42]:
df2=pd.DataFrame({
    "A":np.arange(1,11),
    "B":np.arange(11,21)
})

In [43]:
df2

    A   B
0   1  11
1   2  12
2   3  13
3   4  14
4   5  15
5   6  16
6   7  17
7   8  18
8   9  19
9  10  20

In [44]:
df2["C"]=df2["A"]+df2["B"]

In [45]:
df2

    A   B   C
0   1  11  12
1   2  12  14
2   3  13  16
3   4  14  18
4   5  15  20
5   6  16  22
6   7  17  24
7   8  18  26
8   9  19  28
9  10  20  30

In [46]:
df2["C"]=df2["A"]-df2["B"]
df2

    A   B   C
0   1  11 -10
1   2  12 -10
2   3  13 -10
3   4  14 -10
4   5  15 -10
5   6  16 -10
6   7  17 -10
7   8  18 -10
8   9  19 -10
9  10  20 -10

In [47]:
df2["C"]=df2["A"]*df2["B"]
df2

    A   B    C
0   1  11   11
1   2  12   24
2   3  13   39
3   4  14   56
4   5  15   75
5   6  16   96
6   7  17  119
7   8  18  144
8   9  19  171
9  10  20  200

In [49]:
df2["C"]=df2["A"]/df2["B"]
df2

    A   B         C
0   1  11  0.090909
1   2  12  0.166667
2   3  13  0.230769
3   4  14  0.285714
4   5  15  0.333333
5   6  16  0.375000
6   7  17  0.411765
7   8  18  0.444444
8   9  19  0.473684
9  10  20  0.500000

In [53]:
df2["C"]=df2["A"]//df2["B"]
df2

    A   B  C          D
0   1  11  0   4.000000
1   2  12  0   4.666667
2   3  13  0   5.333333
3   4  14  0   6.000000
4   5  15  0   6.666667
5   6  16  0   7.333333
6   7  17  0   8.000000
7   8  18  0   8.666667
8   9  19  0   9.333333
9  10  20  0  10.000000

In [54]:
df2["C"]=df2["A"]//df2["B"]
df2

    A   B  C          D
0   1  11  0   4.000000
1   2  12  0   4.666667
2   3  13  0   5.333333
3   4  14  0   6.000000
4   5  15  0   6.666667
5   6  16  0   7.333333
6   7  17  0   8.000000
7   8  18  0   8.666667
8   9  19  0   9.333333
9  10  20  0  10.000000

In [55]:
df2["D"]=(df2["A"]+df2["B"]+df2["C"])/3
df2

    A   B  C          D
0   1  11  0   4.000000
1   2  12  0   4.666667
2   3  13  0   5.333333
3   4  14  0   6.000000
4   5  15  0   6.666667
5   6  16  0   7.333333
6   7  17  0   8.000000
7   8  18  0   8.666667
8   9  19  0   9.333333
9  10  20  0  10.000000